Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །རྔ་དང་གླིང་བུའི་སྒྲ་མཆོག་སྣ་ཚོགས་དང་། །སྒྲ་སྙན་རོལ་མོའི་ཡོན་ཏན་སྣ་ཚོགས་ཀྱིས།
en: With paṭaha drums, lutes, the excellent sound of flutes, With the qualities of music of various kinds of melodious sounds,

source: །དང་བའི་ཡིད་ལྡན་འདྲེན་པ་མཆོད་པར་གྱིས།
en: Make an offering to the Guide with a pure mind. {51}

source: །སངས་རྒྱས་སྐུ་གཟུགས་ཤིན་ཏུ་མཛེས་པ་དག །རིན་ཆེན་བྱི་དོར་ལེགས་པར་བྱས་པ་ཡང་།
en: “Create beautiful images of the Buddha, Perfectly made of precious materials,

source: །བལྟ་ན་སྡུག་ཅིང་ཤིན་ཏུ་བཟང་པོ་གྱིས།
en: That are attractive and extremely beautiful,

source: །དེ་བཞིན་གསེར་དག་དང་ནི་དངུལ་དག་དང་། །ཙན་དན་གྱི་ནི་སྐུ་གཟུགས་བཟང་པོ་དག །མཛེས་ཤིང་ཤིན་ཏུ་བལྟ་ན་སྡུག་པ་གྱིས།
en: “Make excellent images that are fashioned From gold or silver, and also sandalwood, That are attractive and extremely beautiful,

source: །འཇི་བ་དང་ནི་དེ་བཞིན་རྡོ་བ་དང་། །ཤིང་དང་རི་མོར་བྲིས་པའི་སྐུ་གཟུགས་དག །མཛེས་ཤིང་ཤིན་ཏུ་བལྟ་ན་སྡུག་པ་གྱིས།
en: “Make images that are fashioned of clay, Or stone, or wood, or painted, That are attractive and extremely beautiful,

source: །རྟག་ཏུ་ནགས་ཁྲོད་དབེན་པར་བསྙེན་པར་གྱིས།
en: “Always remain in the solitude of forests,

source: །གྲོང་དང་གྲོང་ཁྱེར་དགའ་བ་རྣམ་སྤོངས་ལ།
en: Forsaking the joys of villages and towns.

source: །བསེ་རུ་ལྟ་བུར་གཉིས་སུ་མེད་པར་གྱིས།
en: Be without a companion, like a rhinoceros,

source: །ང་ནི་ཆོས་རྗེ་ཁྱོད་ནི་ང་ཡི་བུ།
en: “I am the Lord of the Dharma; you are my son.

source: །ང་ཡི་ཏིང་འཛིན་སྤྱོད་པ་རྗེས་སུ་སློབས།
en: Train in this samādhi practice of mine.

source: །ང་ནི་དེ་ཚེ་ཕྱོགས་སུ་གྲགས་པ་ཡི།
en: I was at that time Dṛdhadatta, the world-renowned

source: །མི་དབང་བརྟན་པས་བྱིན་ཞེས་བྱ་བར་གྱུར།
en: Ruler over the descendants of Manu. {54}

source: །ཏིང་འཛིན་ཞི་བ་མཆོག་འདི་ཚོལ་བའི་ཕྱིར།
en: “Seeking this peace, this supreme samādhi,

source: །ངས་སྔོན་སངས་རྒྱས་མཐའ་ཡས་མཆོད་བྱས་པ།
en: I made offerings to countless buddhas in the past.

source: །རྟག་པར་ངས་ནི་ཚུལ་ཁྲིམས་རྣམ་དག་བསྲུངས།
en: I always maintained pure conduct

source: །ང་ཡིས་སྟོབས་བཅུ་དག་ལ་རི་མོར་བྱས།
en: And I honored those with the ten strengths. {55}

source: །ངས་སྔོན་བུ་དང་ཆུང་མ་ཡོངས་བཏང་སྟེ།
en: In the past I gave up my sons and wives.

source: །མགོ་དང་རྐང་ལག་མིག་མཆོག་བཟང་པོ་བྱིན།
en: I gave away my supreme, excellent head, legs,

source: །ཞུམ་པའི་སེམས་སུ་ནམ་ཡང་ཡོངས་མ་བྱས།
en: Arms, and eyes without ever being disheartened. {56}

source: །ནོར་འབྲུ་བྲན་ཕོ་བྲན་མོ་བརྒྱ་མང་དང་། །རིན་ཆེན་མང་པོ་ངས་ནི་ཡོངས་བཏང་སྟེ།
en: I gave away wealth and grain, Hundreds of male and female slaves, and many jewels,

source: །སློང་བ་མང་པོ་ཤིན་ཏུ་ཚིམ་པར་བྱས།
en: And satisfied numerous beggars. {57}

source: །ངས་སྔོན་གསེར་དང་མུ་ཏིག་ཤེལ་མང་དང་། །དུང་དང་མན་ཤེལ་དང་ནི་བཻ་དཱུརྱ།
en: In the past I gave away great quantities Of pearls, crystals, gold, conches, ammonite stones, beryls,

source: །ནོར་བུ་གཟུགས་གཙང་བྱི་རུ་འབྲུ་རྣམས་བཏང་།
en: Perfectly pure jewels, and a mass of coral, {58}

source: །ངས་ནི་རྣམ་པ་སྣ་ཚོགས་རྒྱན་རྣམས་དང་། །མུ་ཏིག་ཕྲེང་མཆོག་དེ་བཞིན་སེང་གེ་ཅན།
en: I gave away vast amounts of excellent jewelry Of various kinds, such as perfect strings of pearls,

source: །རིན་ཆེན་དྲ་བ་བཟང་ཞིང་མང་བ་བཏང་།
en: Lion jewelry, and nets of jewels. {59}

source: །ངས་སྔོན་གོས་མཆོག་ཕྲ་མོ་བྱེ་བ་དག །ཡོངས་སུ་གཙང་བ་ཀ་ཤི་དུ་ཀུལ་མཆོག །གསེར་གྱིས་སྤྲས་པ་མང་པོ་ཡོངས་སུ་བཏང་།
en: In the past I gave away many millions Of fine, excellent clothes that were perfectly clean, Made of the finest silk and cloth and beautified by gold threads. {60}

source: །རྟ་དང་བལ་གླང་ཤིང་རྟ་སྣ་ཚོགས་དང་། །བུ་དང་ཆུང་མ་རབ་སྡུག་ངས་བཏང་སྟེ།
en: I gave away various kinds of elephants, horses, chariots, And my own beloved sons and women,

source: །ཡིད་མི་བདེ་བ་ནམ་ཡང་མ་བྱུང་ངོ་།
en: Without ever experiencing any unhappiness. {61}

source: །ཏིང་འཛིན་ཞི་བ་མཆོག་འདི་ཚོལ་བའི་ཕྱིར། །ཚོལ་བས་སྡུག་བསྔལ་ཉོན་མོངས་གྱུར་པ་ཡི།
en: “Seeking this peace, this supreme samādhi,

source: །ཤིན་ཏུ་དབུལ་བའི་མི་དག་ངས་མཐོང་ནས།
en: Whenever I saw people who were very poor, Who were in distress and suffering because of their need,

source: །དེ་དག་ངས་ནི་དབུལ་བ་མེད་པར་བྱས།
en: I freed them from their poverty. {62}

source: །རྟ་དང་བལ་གླང་ཤིང་རྟ་ཁྲག་ཁྲིག་དག །ནོར་བུ་རིན་ཆེན་བརྒྱན་པའི་དྲ་བས་གཡོགས། །ངས་སྔོན་སློང་བ་དག་ལ་སྦྱིན་པར་བྱས།
en: I have in the past given to beggars Trillions of horses, elephants, and chariots Draped in nets of precious jewel adornments. {63}

source: །ངས་སྔོན་སྐྱེད་མོས་ཚལ་ནི་མང་པོ་དག །བྱེ་བ་ཁྲག་ཁྲིག་ལེགས་པར་བརྒྱན་བྱས་ཏེ། །ཡིད་ཀྱང་དགའ་ཞིང་སྙིང་རྗེ་བསྐྱེད་ནས་བྱིན།
en: I have in the past joyfully and with compassion Given away many trillions Of excellently decorated parks. {64}

source: །གྲོང་དང་གྲོང་ཁྱེར་ཡུལ་འཁོར་གྲོང་འདབ་ཀྱང་། །ངས་སྔོན་ལེགས་པར་བརྒྱན་ནས་ཡོངས་སུ་བཏང་།
en: Villages, towns, regions, and market towns,

source: །བྱིན་ནས་རྟག་ཏུ་དགའ་བ་མྱང་བར་བྱས།
en: And having given them felt continuous joy. {65}

source: །རིན་ཆེན་ཕུང་པོ་རི་རབ་མཉམ་པ་དང་། །དེ་བཞིན་གོས་དང་རྒྱན་རྣམས་མང་པོ་ཡང་། །ངས་སྔོན་སློང་བ་དག་ལ་སྦྱིན་པ་བྱས།
en: Heaps of jewels as large as Sumeru And a similar amount of clothes and adornments. {66}

source: །ཤིན་ཏུ་དབུལ་བ་ངས་ནི་ཕྱུག་པོར་བྱས།
en: I have made those who are very poor rich,

source: །རབ་ཏུ་ཉོན་མོངས་གྱུར་པ་ངས་བསྐྱབས་ཏེ།
en: I have protected those who were in great distress,

source: །སྡུག་བསྔལ་གཙེས་པ་མང་པོ་བདེ་བར་བྱས།
en: And I have made happy many who were enduring suffering. {67}

source: །ང་ནི་ས་སྟེང་དབང་ཕྱུག་གྱུར་པའི་ཚེ།
en: “When I was a sovereign over this world

source: །སྐྱེ་བོའི་ཚོགས་རྣམས་སྡུག་བསྔལ་མཐོང་ནས་ནི།
en: And saw the suffering of the population,

source: །སྙིང་རྗེ་བསྐྱེད་ནས་བདེ་བར་གྱུར་ཅིག་ཅེས།
en: I felt compassion and wished them to be happy,

source: །དེ་དག་ལ་ནི་ང་ཡིས་རྒྱལ་སྲིད་བཏང་།
en: And gave my kingdom to them. {68}

source: །གཞོན་ནུ་ངས་ནི་ངོ་མཚར་བྱས་པ་དང་། །བསྐལ་པ་བརྒྱ་མང་དཀའ་བ་ཅི་སྤྱད་པ།
en: “Young man, the marvelous things that I have done, And the hardships I have undergone for many hundreds of eons,

source: །ངས་ནི་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་ཏུ། །དེ་དག་བཤད་ཀྱང་ཟད་པར་མི་ནུས་སོ།
en: I would not be able to complete recounting them Even in a quintillion eons. {69}

source: །ངས་ནི་ངོ་མཚར་དཀའ་བ་སྤྱད་པ་ནི།
en: I underwent astonishing hardships.

source: །བདེ་བར་གཤེགས་པའི་སྤྱོད་ལ་མ་དད་པ།
en: The people without faith in the Sugata’s conduct

source: །མི་རྣམས་སེམས་ནི་མྱོས་ཤིང་བསླད་པར་འགྱུར།
en: Will have minds that become crazed and polluted. {70}

source: །གཞོན་ནུ་ཁྱོད་ལ་ཤིན་ཏུ་བསྒོ་བར་བྱ།
en: “Young man, I declare this to you:

source: །དད་པར་གྱིས་ཤིག་ང་ལ་མི་བདེན་མེད།
en: Have faith in me; my words are not untrue.

source: །བདེ་གཤེགས་བརྫུན་གྱི་ཚིག་ནི་མི་གསུང་སྟེ། །ཐུགས་རྗེ་རྒྱལ་བ་རྟག་ཏུ་བདེན་པར་གསུང་།
en: The Sugata does not speak words that are false. The compassionate Jina always speaks the truth. {71} “These many different kinds of practices I will have carried out for many eons.

source: །ཇི་ལྟར་ཏིང་འཛིན་མཆོག་ཀྱང་འཐོབ་འགྱུར་ཞིང་།
en: However I attain this supreme samādhi

source: །སེམས་ཅན་ཁྲག་ཁྲིག་སྡུག་བསྔལ་ཐར་བྱ་ཞེས། །བསྐལ་པ་མང་པོར་སྤྱོད་པ་འདི་དག་དང་། །གཞན་ཡང་ངས་ནི་རྣམ་པ་མང་པོ་སྦྱངས། །སྐད་ཅིག་གང་ལ་ཏིང་འཛིན་འདི་ཡང་ནི།
en: I will then free millions of beings from suffering. {72}

source: །ང་ཡིས་རབ་ཏུ་ཐོབ་པར་གྱུར་པའི་ཚེ།
en: “In the moment that I have attained

source: །ཏིང་འཛིན་དམ་པ་ཡེ་ཤེས་ཆེན་པོའི་ལམ།
en: This samādhi, the path of great wisdom, Having attained this supreme samādhi

source: །ངས་ཐོབ་སངས་རྒྱས་ཁྲག་ཁྲིག་མང་པོ་མཐོང་།
en: I will see numerous millions of buddhas. {73}

source: །རྫུ་འཕྲུལ་དག་ཀྱང་མཐའ་ཡས་ངས་ཐོབ་སྟེ།
en: “I will have attained infinite miraculous powers,

source: །ཞིང་བརྒྱ་དག་ཏུ་རྣམ་པར་སྤྲུལ་པས་འགྲོ།
en: And my emanations will go to hundreds of realms,

source: །སོང་ནས་ངས་ནི་སྙིང་རྗེ་ལྡན་པ་ལ།
en: And there I will ask the compassionate ones

source: །དྲི་བ་བྱེ་བ་ཁྲག་ཁྲིག་མང་པོ་དྲིས།
en: Many quintillions of questions. {74}

source: །བདེ་གཤེགས་དག་གིས་ང་ལ་ཅི་བསྟན་པ།
en: “The sugatas will give me answers

source: །དེ་ཚེ་དྲི་བ་བྱེ་བ་ཁྲག་ཁྲིག་བཟུང་།
en: For my quintillions of questions,

source: །ང་ཡིས་མ་ལུས་ཐམས་ཅད་བཟུང་བྱས་ཏེ།
en: And having obtained them I will remember them all

source: །ཚིག་གཅིག་ཙམ་ཡང་ང་ལ་ཉམས་པ་མེད།
en: And I will not forget even a single word. {75} “Having listened to the answers to those

source: །དྲི་བ་བྱེ་བ་ཁྲག་ཁྲིག་མང་པོ་ཡི། །ཡང་དག་པ་ཡི་ཚུལ་དེ་ངས་ཐོས་ནས།
en: Quintillions of correct questions,

source: །རྡུལ་བྲལ་ཞི་བའི་གནས་དེ་ངས་བཤད་དེ།
en: I will teach the stainless state of peace

source: །སེམས་ཅན་མང་པོ་ཡེ་ཤེས་ལམ་ལ་བཀོད།
en: And establish many beings on the path of wisdom. {76}

source: །ངས་ནི་ཏིང་འཛིན་འདི་ལ་གནས་ནས་སུ།
en: “I will remain in this samādhi

source: །བསྐལ་པ་བརྒྱར་ཡང་ཡང་དག་ཚུལ་བསླབས་ཏེ།
en: And train in it for many hundreds of eons,

source: །ངས་སྔོན་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་རྣམས།
en: And will first bring many quintillions of beings

source: །རྡུལ་དང་བྲལ་བའི་ལམ་མཆོག་དམ་པར་བཀོད།
en: On to the highest stainless path. {77}

source: །གང་གིས་སྔོན་གྱི་བདེ་བར་གཤེགས་པ་དག །རྡུལ་དང་བྲལ་བའི་ཚུལ་འདི་སྟོན་པ་རྣམས།
en: “Those who have not seen the previous sugatas

source: །མ་མཐོང་བས་ནི་དོན་དམ་སྟོང་པ་ཡི།
en: Who have taught this stainless way

source: །ཏིང་འཛིན་མཆོག་ལ་དད་པར་མི་ནུས་སོ།
en: Will not be able to have faith In the supreme samādhi of emptiness, the ultimate truth. {78}

source: །མི་གང་དད་ཅིང་མཁས་ལ་ཆོ་ག་ཤེས།
en: “The people who have faith, are wise, and know the practice,

source: །ཡང་དག་ཚུལ་ཟབ་ཚུལ་རྣམས་ཐོས་པ་ནི། །དེ་དག་མི་སྐྲག་དངང་བར་མི་འགྱུར་ཏེ། །ཐོས་ནས་རྟག་ཏུ་ཡིད་ཀྱང་རངས་པར་འགྱུར།
en: Are always joyful when they hear The way that is correct and profound, And do not become frightened or terrified. {79}

source: །དེ་དང་དེ་དག་བྱང་ཆུབ་འདི་འཛིན་ཏེ།
en: “They hold the supreme enlightenment.

source: །དེ་དག་རྗེས་སུ་སྐྱེས་པའི་ང་ཡི་བུ།
en: They have been reborn as my sons.

source: །དེ་དག་ཨུ་དུམ་བཱ་རའི་མེ་ཏོག་འདྲ།
en: They are like fig-tree flowers,

source: །དེ་ཕྱིར་བསྐལ་པ་བརྒྱར་ཡང་ངས་སྤྱད་དོ།
en: And I practice for hundreds of eons for their sake. {80}

source: །ཏིང་འཛིན་མཆོག་འདི་མི་གང་འཛིན་པ་ནི།
en: “They who possess this supreme samādhi

source: །དེ་དག་ལོག་པར་ལྟུང་བའི་འཇིགས་པ་མེད།
en: Have no fear of falling into unfortunate existences,

source: །རྟག་ཏུ་མི་ཁོམ་བརྒྱད་དང་དེ་བྲལ་ཏེ།
en: Are always free of the eight disadvantageous states,

source: །སངས་རྒྱས་ཁྲག་ཁྲིག་ཤིན་ཏུ་མང་པོ་མཐོང་།
en: And will see numerous millions of buddhas. {81}

source: །གང་གི་ལག་ན་ཏིང་འཛིན་མཆོག་ཡོད་པ།
en: “They who have this supreme samādhi in their hands, I prophesy, will have unending understanding,

source: །རྒྱལ་བ་བྱམས་པ་གྲགས་པ་མཐའ་ཡས་བཞིན།
en: And like the kind Jina who has infinite fame,

source: །སེམས་ཅན་རྣམས་ཀྱི་དོན་མང་བྱེད་འགྱུར་ཞེས། །བློ་གྲོས་མཐའ་ཡས་དེ་ནི་ངས་ལུང་བསྟན།
en: They will accomplish many benefits for beings. {82}

source: །དེ་དག་དྲན་དང་ལྡན་ཞིང་བློ་གྲོས་ལྡན།
en: Will have understanding and memory,

source: །རྟོགས་ལྡན་ཡེ་ཤེས་འཕགས་པ་ཐོས་པ་འཛིན།
en: High wisdom, will retain what they have heard,

source: །དེ་ཡི་སྤོབས་པ་དག་ཀྱང་རྒྱ་ཆེར་འགྱུར།
en: And will possess vast confidence of speech. {83}

source: །མི་གང་ཏིང་འཛིན་མཆོག་འདི་འཛིན་པ་ནི།
en: “They who possess this samādhi

source: །ལྷ་རྣམས་ཀྱིས་ཀྱང་མཆོད་པར་བྱ་བ་ཡིན།
en: Will receive the offerings of devas,

source: །མིས་ཀྱང་རྟག་ཏུ་ཕྱག་བྱར་འོས་པ་སྟེ།
en: Will be continually revered by humans,

source: །ཁོར་མོར་འབྱུང་བའི་ཚོགས་ཀྱིས་མངོན་པར་སྲུང་།
en: And will be constantly protected by the hosts of spirits. {84}

source: །དེ་དག་མེ་དང་ཆུར་ཡང་མི་འཆི་ཞིང་།
en: Do not die in fire or water,

source: །དེ་ལ་དུག་དང་མཚོན་གྱིས་མི་ཚུགས་ཏེ།
en: Are not harmed by poison or weapons,

source: །དགྲ་དག་གིས་ཀྱང་བརྒལ་བར་མི་ནུས་འགྱུར།
en: And cannot be reached by enemies. {85}

source: །དེ་དག་ནགས་ཁྲོད་གཤོང་གནས་རྟག་པར་ཡང་། །ལྷ་དག་ཁོར་མོར་བསྙེན་བཀུར་བྱེད་པར་འགྱུར།
en: Will always dwell in forest bowers, Where they will be constantly attended by devas,

source: །གནོད་སྦྱིན་མང་པོ་དེ་ཡི་གཡོག་ཀྱང་བྱེད།
en: And where many yakṣas will be their servants. {86}

source: །ཡེ་ཤེས་དག་ཀྱང་རྒྱ་མཚོ་འདྲ་བར་འགྱུར།
en: Will have wisdom that is as vast as the ocean,

source: །ཐུབ་པའི་ཡོན་ཏན་བརྗོད་ལ་ཐོགས་པ་མེད།
en: Will describe without impediment the qualities of the Sage,

source: །སངས་རྒྱས་ཡོན་ཏན་ཡང་དག་རྗོད་པར་བྱེད།
en: And make known correctly the qualities of the Buddha. {87}

source: །དེ་ཡི་ཐོས་པ་མཐའ་ཡས་མུ་མེད་དེ།
en: Will have endless, boundless learning

source: །ཚད་རྙེད་མི་འགྱུར་ཇི་ལྟར་ནམ་མཁའ་བཞིན།
en: That is beyond measure, like space,

source: །ཡེ་ཤེས་སྒྲོན་མ་འཛིན་ཅིང་རབ་རིབ་སེལ།
en: And will hold the torch of wisdom that dispels darkness. {88}

source: །རྟག་པར་འཇམ་ཞིང་རིགས་པའི་ཚིག་སྨྲ་སྟེ།
en: Will always be gentle, will speak appropriate words,

source: །འཁོར་གྱི་ནང་དུ་དགའ་བར་འགྱུར་བ་སྟོན།
en: Will be beloved in the midst of their followers,

source: །སེང་གེ་བཞིན་དུ་དེ་ནི་སྒྲ་རྣམས་སྒྲོག །མི་གང་ཏིང་འཛིན་མཆོག་འདི་འཛིན་པ་ནི།
en: And their speech will be like the lion’s roar. {89} “They who possess this supreme samādhi

source: །དེ་ནི་སྨན་པ་དཔྱད་མཁན་འདྲ་བར་ཡང་།
en: Will be like healing physicians,

source: །མང་པོའི་རྟེན་དང་དཔུང་གཉེན་སྐྱབས་སུ་འགྱུར།
en: The support, protector, and refuge of many,

source: །འཇིག་རྟེན་དག་ན་སྣང་བར་གྱུར་ཅིང་སྤྱོད།
en: And will bring illumination to the worlds. {90}

source: །འཁྲིག་པ་དག་ལ་ཡིད་ཀྱང་དགའ་མི་བྱེད།
en: Will not take pleasure in sexual intercourse.

source: །ཞི་གནས་དགའ་ཞིང་བསམ་གཏན་བདེ་བ་རེག །རབ་ཏུ་ཞི་བའི་དབྱིངས་སུ་ཞི་བར་སྨྲ།
en: They will enjoy śamatha and reach the bliss of dhyāna. With a peaceful voice they will speak of peace. {91}

source: །དེ་ཡིད་མཚན་མ་དག་ལ་མི་དགའ་སྟེ།
en: Will not take pleasure in conceptualization,

source: །མཚན་མ་མང་པོ་ཐམས་ཅད་རྣམ་པར་བཤིག །མཁས་པ་རྟག་ཏུ་མཉམ་པར་བཞག་ཅིང་སྤྱོད།
en: Will be free of the entire multitude of concepts, And those wise ones will constantly be in meditation. {92}

source: །དེ་ཡི་མིག་ཀྱང་ཐ་མལ་མ་ཡིན་འཐོབ།
en: Will attain extraordinary vision

source: །དེས་ནི་རྒྱལ་བ་མཐའ་ཡས་མཐོང་བར་འགྱུར།
en: And will see the infinite jinas.

source: །མཐའ་ཡས་མིག་ལྡན་དེ་ནི་ཁྱུ་མཆོག་འགྱུར།
en: They will be leaders with infinite sight. {93}

source: །ཁྲུང་ཁྲུང་སྒྲ་དབྱངས་འཇམ་ཞིང་མཉེན་དང་ལྡན།
en: Will have the sweet and melodious voice of a crane,

source: །ཀ་ལ་པིང་ཀ་རྔ་ཡི་དབྱངས་སུ་འགྱུར།
en: The sound of the avadavat and a drumbeat,

source: །གླུ་དབྱངས་ལྡན་ཞིང་སྒྲ་སྐད་འཇམ་པར་འགྱུར།
en: And a singing sound and gentle voice. {94}

source: །སྤྲིན་གྱི་འབྲུག་སྒྲ་བསྒྲགས་པའི་སྐད་རྣམས་དང་། །ངང་པའི་སྒྲ་དབྱངས་བཞིན་དུ་འཇམ་པར་སྒྲོག །དབྱངས་ཀྱི་ཡན་ལག་ལྔ་བརྒྱར་ལྡན་པའི་སྒྲ།
en: Will have a voice that is like resounding thunder. Their gentle speech will be like the song of a goose And their voice will have the fifty aspects of speech. {95}

source: །བསྐལ་པ་བྱེ་བ་མང་པོ་ཁྲག་ཁྲིག་ཏུ།
en: Will speak with an inconceivable voice

source: །དབྱངས་ཀྱི་ཡན་ལག་སྣ་ཚོགས་ལྡན་པ་ཡི།
en: That has the pleasant sound of the various aspects of speech

source: །སྒྲ་དབྱངས་སྙན་པ་བསམ་གྱིས་མི་ཁྱབ་འབྱུང་།
en: For numerous quintillions of eons. {96}

source: །ཟས་ལ་ཡིད་ཀྱང་ཆགས་པར་མི་འགྱུར་ཏེ།
en: Will not have attachment to food,

source: །ལྷུང་བཟེད་ཆོས་གོས་དག་ལ་དགའ་མ་ཡིན།
en: Will not delight in alms bowls or dharma robes,

source: །འདོད་པ་ཉུང་ཞིང་ཆོག་ཤེས་ཡོ་བྱད་བསྙུངས།
en: But with few desires they will be content and abstinent. {97}

source: །བདག་ཉིད་ལ་ཡང་སྟོད་པར་མི་འགྱུར་ཞིང་།
en: Do not praise themselves

source: །གར་ཡང་གཞན་ལ་མི་སྙན་མི་རྗོད་དེ།
en: And never criticize others.

source: །རྟག་ཏུ་བསམ་གཏན་དགའ་ཞིང་ཕྲ་བའི་སེམས།
en: They always delight in dhyāna and have a subtle mind. {98}

source: །རྟག་ཏུ་བདག་ཉིད་ལ་ཡང་རྟོག་འགྱུར་ཏེ།
en: Always examine themselves,

source: །གཞན་གྱི་འཁྲུལ་པ་དག་ནི་དེ་མི་ཚོལ།
en: Do not look for mistakes in others,

source: །འཇིག་རྟེན་ཀུན་དང་དེ་ནི་མི་འཕྲོད་མེད།
en: And the entire world does not impede them. {99}

source: །སྤྱོད་པ་ཡོངས་དག་སེམས་ལ་ཉོན་མོངས་མེད།
en: Have pure conduct and untroubled minds,

source: །རྟག་ཏུ་གཡོ་ཡང་མེད་ཅིང་འདྲིད་པ་མེད།
en: Are never deceitful or dishonest,

source: །ཁོར་མོར་འཇམ་ཞིང་རྣམ་པར་ཐར་ལ་དགའ།
en: Are always gentle, and always delight in liberation. {100}

source: །རྟག་ཏུ་གཏོང་ལ་ཤིན་ཏུ་མོས་པར་འགྱུར།
en: Are always motivated to generosity,

source: །དེ་ནི་སེར་སྣའི་སེམས་ལ་དགའ་མི་བྱེད།
en: Take no delight in avarice,

source: །ཁོར་མོར་ཚུལ་ཁྲིམས་དང་ཡང་ལྡན་པར་འགྱུར།
en: And always have correct conduct. {101}

source: །བྱད་བཞིན་བཟང་ཞིང་བལྟ་སྡུག་མཛེས་པ་སྟེ།
en: Are handsome, good looking, and attractive.

source: །མདོག་ཀྱང་གསེར་མཆོག་འདྲ་བར་སྣང་བར་བྱེད།
en: Their bodies shine like the purest gold

source: །སུམ་ཅུ་རྩ་གཉིས་མཚན་རྣམས་འཆང་བར་འགྱུར།
en: And have the thirty-two primary signs of a great being. {102}

source: །དེ་དག་རྟག་པར་རབ་ཏུ་མཛེས་པར་འགྱུར།
en: Always have an attractive appearance,

source: །ཁོར་མོར་རྟོག་ཅིང་སྐྱེ་བོ་མང་པོ་ལ།
en: Are observed and beloved by many people,

source: །ཕངས་ཤིང་སྡུག་སྟེ་ལྟ་བས་མི་ངོམས་འགྱུར།
en: And those people never have enough of gazing upon them. {103}

source: །ལྷ་དང་ཀླུ་དང་དེ་བཞིན་གནོད་སྦྱིན་རྣམས། །རྟག་ཏུ་ཡི་རང་དགའ་ཞིང་མགུ་ནས་ནི།
en: Always delight, gladden, and enchant Devas, nāgas, and likewise the yakṣas,

source: །གྲོང་དུ་ཞུགས་ནས་དེ་ཡི་བསྔགས་པ་སྨྲ།
en: Who enter towns and praise them. {104}

source: །ཚངས་པ་བརྒྱ་བྱིན་དབང་སྒྱུར་མང་པོ་དག །རྟག་པར་དེ་ལ་རིམ་གྲོ་རབ་ཏུ་བྱེད།
en: Always have Brahmā, Śakra, and many powerful deities Acting as their attendants,

source: །དེ་ཡི་ཡིད་ཀྱང་ཁེངས་པར་ཡོང་མི་འགྱུར།
en: But there is no pride in their minds. {105}

source: །དེ་ལ་ངན་འགྲོའི་འཇིགས་པ་མི་འབྱུང་སྟེ།
en: Have no fear of the lower existences.

source: །མི་ཁོམ་མེད་ཅིང་ལོག་ལྟུང་འཇིགས་པ་མེད།
en: They have no fear of the disadvantageous existences or bad rebirths.

source: །ལོག་ལྟུང་འཇིགས་པ་ཀུན་ལས་ཡོངས་སུ་གྲོལ།
en: They are completely free of all fear of bad rebirths. {106}

source: །སངས་རྒྱས་ཆོས་མཆོག་ཞིབ་མོ་ཐོས་ནས་ཀྱང་། །དེ་ལ་ནེམ་ནུར་ཡིད་གཉིས་མི་འབྱུང་སྟེ།
en: On hearing in detail the supreme Dharma of the Buddha,

source: །ཡེ་ཤེས་ཟབ་མོའི་རྗེས་སུ་སོང་བ་ཡིན།
en: And they follow that profound wisdom. {107}

source: །ཕྲ་བའི་ཆོས་རྣམས་གང་དག་ཅི་ཐོས་ཀྱང་།
en: Whatever subtle Dharma teachings they hear

source: །ཐམས་ཅད་ལ་ནི་དབང་གི་ཕ་རོལ་སོང་།
en: They attain perfect mastery of them all,

source: །གཏན་ཚིགས་ཞིབ་ཅིང་སྟོབས་དང་ལྡན་པར་འགྱུར།
en: And gain their power and detailed reasoning. {108}

source: །རྒྱལ་བས་གསུང་ནི་དེ་སྐད་རབ་བཤད་དེ། །རྟག་པར་བདག་ནི་དེ་ལྟར་བྱ་སྙམ་ན།
en: With what the Jina’s words have taught,’

source: །གཟུངས་ནི་བྱེ་བྲག་འཕགས་པ་མཆོག་ཐོབ་འགྱུར།
en: And attain unique, supreme retention. {109}

source: །ནམ་ཚེ་དེ་ཡང་འཆི་བའི་དུས་བྱེད་པ།
en: Will, when the time of their death comes,

source: །འོད་དཔག་མེད་པ་ཐུགས་རྗེར་ལྡན་པ་ནི།
en: Have before them the compassionate Amitābha

source: །དགེ་སློང་ཚོགས་བཅས་དེ་ཡི་མདུན་ན་བཞུགས།
en: And his host of bhikṣus. {110}

source: །དེ་དག་གཟུངས་རྣམས་རབ་ཏུ་ཐོབ་པར་འགྱུར།
en: Are those who have attained the retentions,

source: །ཆོས་ཀྱི་གཏེར་ལ་དབང་བའི་ཕ་རོལ་ཕྱིན།
en: Have perfect mastery over the treasure of the Dharma,

source: །སྤོབས་དང་ལྡན་ཞིང་ཚིག་ཀྱང་རྒྱུན་མི་འཆད།
en: And possess the unceasing words of eloquence. {111}

source: །ཆོས་འཛིན་དེ་དག་གང་དུ་སོང་བར་ཡང་། །འགྲོ་བ་དག་ལ་ཀུན་ཏུ་སྣང་བར་འགྱུར།
en: Wherever those holders of the Dharma go. {112}

source: །ཤིན་ཏུ་སྤྱོད་པ་ཞི་ཞིང་ཡིད་རབ་ཞི།
en: “They attain the ten bhūmis:Perfect Joy,

source: །རབ་ཏུ་དགའ་དང་དྲི་མེད་འོད་བྱེད་དང་། །འོད་འཕྲོ་ཤིན་ཏུ་སྦྱང་དཀའ་མངོན་གྱུར་དང་། །རིང་དུ་སོང་དང་མི་གཡོ་ལེགས་པའི་བློ།
en: Stainless, Shining, Brilliance, Difficult to Master, Manifest, Gone Far, Unwavering,

source: །ཆོས་སྤྲིན་ས་བཅུ་པོ་ཡང་འཐོབ་པར་འགྱུར།
en: Perfect Understanding, and Clouds of Dharma. {i} “Those heroes attain the ten powers:

source: །ཚེ་དང་ལས་དང་ཡོ་བྱད་མོས་པ་དང་། །སྨོན་ལམ་རྫུ་འཕྲུལ་སྐྱེ་བའི་སྟོབས་རྣམས་དང་། །ཆོས་དང་སེམས་དང་དེ་བཞིན་ཡེ་ཤེས་ཆེ། །དབང་བཅུ་འདི་དག་དཔའ་བོས་ཐོབ་པར་འགྱུར།
en: Life, karma, materials, and devotion, And the strengths of aspiration, miracles, and birth, Dharma, mind, and likewise great wisdom. {ii}

source: །མཁས་པ་ཆོས་ཀྱི་མཛོད་མཆོག་རྣམ་འབྱེད་ཅིང་།
en: Are skilled in the various aspects of the supreme Dharma treasure,

source: །ཆོས་ཀྱི་སྐུ་ལ་དབང་བའི་ཕ་རོལ་ཕྱིན།
en: Have attained the perfect power of the dharmakāya,

source: །དེ་ནི་འགྲོ་བ་ཀུན་གྱི་ཐེ་ཚོམ་གཅོད།
en: And cut through the doubts of all beings. {113}

source: །སེམས་ཅན་ཐམས་ཅད་བཅོམ་ལྡན་སྙིང་རྗེ་ཅན།
en: “If all beings were compassionate bhagavāns,

source: །སྲིད་པའི་མཐར་ཕྱིན་བདེ་གཤེགས་གྱུར་པ་ལ།
en: And were sugatas until existence comes to an end,

source: །བསྐལ་པ་མང་པོ་བརྒྱ་འམ་གང་གཱ་ཡི། །བྱེ་མ་སྙེད་དམ་ལྷག་པར་མཆོད་བྱས་པས།
en: And if someone were to make offerings to them for many hundreds of eons Or for more eons than there are sand grains in the Ganges, {114}

source: །ཟད་པའི་དུས་ན་མི་གང་ལ་ལ་ཡིས།
en: “And if in this latter time of destruction

source: །འདིར་ཡང་ཏིང་ངེ་འཛིན་འདི་ཐོས་ནས་སུ།
en: Someone were to hear this samādhi

source: །ཡི་རང་ཞེས་ནི་ཚིག་གཅིག་སྨྲས་ན་ཡང་།
en: And say only the words ‘I rejoice in this!’

source: །སྔ་མའི་བསོད་ནམས་ཕུང་པོས་ཆར་མི་ཕོད།
en: The previous merit would not be a fraction of this accumulation. {115}

source: །གཞོན་ནུ་སུ་དག་ཞི་བའི་སྤྱོད་པ་འདི།
en: “Young man, whoever has this practice of peace,

source: །དོན་དམ་སྟོང་པ་ཏིང་ངེ་འཛིན་གྱི་མཆོག །རབ་ཏུ་འདོན་དང་དེ་བཞིན་གླེགས་བམ་བྱས།
en: This supreme samādhi, the ultimate truth of emptiness, Propagates it and creates copies of it,

source: །ཆོས་སྨྲ་བློ་གྲོས་དམ་པ་གནས་པ་ཡིན།
en: That one is a dharmabhāṇaka with wisdom.” {116}

source: །གཟི་བརྗིད་ཚོགས་ཀྱི་རྒྱལ་པོའི་ལེའུ་སྟེ་སུམ་ཅུ་པའོ།། །།དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ།
en: Conclusion of the thirtieth chapter, “Tejaguṇarāja.” Benefits Chapter 31

source: གཞོན་ནུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཅི་ནས་བདག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲ་དང་སྐད་ཤེས་པ་རྟོགས་ཤིང་། དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་རྣམ་པར་རིག་ནས་ཆོས་བསྟན་ཏོ་སྙམ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་གཞོན་ནུ་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་འདི་མཉན་པར་བྱ། གཟུང་བར་བྱ། ཀུན་ཆུབ་པར་བྱ། བཅང་བར་བྱ། བཀླག་པར་བྱ། རབ་ཏུ་གདོན་པར་བྱ། ལུང་མནོད་ཅིང་ཁ་ཏོན་དུ་བྱ། ཉོན་མོངས་པ་མེད་པའི་བསྒོམ་པས་བསྒོམ་པར་བྱ། མང་དུ་བྱ། གཞན་ལ་ཡང་རྒྱ་ཆེར་རབ་ཏུ་བསྟན་པར་བྱའོ། །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ།
en: Then the Bhagavān said to the youth Candraprabha, “Therefore, young man, bodhisattva mahāsattvas who think, ‘I shall understand the languages of all beings and, knowing their higher or lesser capabilities, I will teach them the Dharma,’ those bodhisattva mahāsattvas should listen to the samādhi, the revealed equality of the nature of all phenomena, learn it, understand it, keep it, recite it to others, promote it, proclaim it, chant it, meditate on it with unadulterated meditation, promulgate it, and make it widely known to others.” Thereupon the Bhagavān spoke these verses:

source: །ཐར་པ་འདོད་པ་ཏིང་འཛིན་རྡུལ་བྲལ་འདི་འཛིན་ན།
en: “They who, desiring liberation, possess this stainless samādhi

source: །དེས་ནི་འདས་པའི་འདྲེན་པ་ཚད་མེད་རྣམས་ཀྱང་མཐོང་།
en: See the countless guides of the past,

source: །སྔོན་གྱི་སྲིད་པར་བརྩོན་བྱས་འཇིག་རྟེན་མགོན་པོས་དྲིས།
en: Ask those lords of the world about their previous practice,

source: །བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་རྩ་བ་མཆོག་ལ་གནས།
en: And those bodhisattvas dwell in supreme roots of merit. {1}

source: །ལྷ་དང་མི་ཡི་བདེ་བ་གྱ་ནོམ་རྙེད་པར་འགྱུར།
en: Obtain the highest happiness of devas and humans,

source: །ལྷ་དང་མི་ཡི་མཆོད་པ་དམ་པ་དེས་འཐོབ་སྟེ།
en: Obtain the supreme offerings of devas and humans,

source: །བསམ་གཏན་བདེ་དང་འཕགས་པའི་བདེ་བ་མཆོག་ཀྱང་འཐོབ།
en: And obtain the happiness of dhyāna, the supreme, noble happiness. {2}

source: །བསྔགས་པ་རྒྱ་ཆེར་ཐོས་ཀྱང་དེ་ནི་དགའ་མི་འགྱུར།
en: Do not become thrilled on hearing the highest praises,

source: །མི་སྙན་པ་དག་ཐོས་ཀྱང་ཞུམ་པར་མི་འགྱུར་ཏེ།
en: Do not become saddened by being criticized,

source: །འཇིག་རྟེན་ཆོས་བརྒྱད་དག་གིས་མི་རྒུལ་རི་བོ་བཞིན།
en: And like a mountain are unmoved by the eight worldly concerns. {3}

source: །དགེ་ཞིང་མཉེན་པར་སྨྲ་ལ་འཇམ་པའི་ཚིག་དང་ལྡན།
en: Speak perfectly pleasantly, with gentle words,
